inline fun <reified E> Collection<E>.union(other: Collection<E>): List<E> {
    return listOf(*this.toTypedArray(), *other.toTypedArray())
}
fun main() {
    val string = "אני סטודנט שנה ד', בן 29, יש לי הון נזיל של כמעט 700 אלף ש\"ח. \t\t   \t\t \t\t\t  \t\t \t\t\t \t  \n" +
            "למה אני מציין את זה? לא להשוויץ חס וחלילה,  (אין אחד שלומד איתי שיודע שזה סדר הגודל של העו\"ש שלי! ואף אחד גם לא ידע בעתיד)  אני אומר את זה כי אני מתבונן בשאר הסטודנטים שלצידי, רובם לא עובדים, או עובדים 40 אחוז משרה גג! ותוהה לעצמי איך לעזאזאל אנשים יסתדרו בחיים שלאחר התואר? הסיבה  שלי להתחיל ללמוד מאוחר(גיל 25) היא כדי שאוכל לעבוד בעבודות\" שחורות\" עם הרבה כסף, משהו שלא אפשרי כמעט אחרי התואר, כי אנחנו הרי רוצים לעבוד בתחום שלמדנו, ואז זהו אין סיכוי ריאלי להגיע לרמת חסכון כזאת. \t\t  \t \t \t\t   \t\t \t\t \t    \t\t \t\t\t  \t\t \t  \t \t\t \t\t\t\t\n" +
            "עבדתי 4 שנים בעבודות קשות, מתוכם שנתיים בחו\"ל, לא החזקתי רכב, שכרץי דירה רק כשזה ממש היה נחוץ לטובת מיקום העבודה וכך הצלחתי לחסוך. \t\t \t\t\t  \t\t\t\t \t\t \t\t \t     \t\t   \t \t\t  \t    \t\t   \t \t\t \t\t\t  \t\t  \t\t\t \t\n" +
            "למה אני משתף את זה? כח אני שם לב שעכשיו כסטודנט אין לי לחץ כלכלי כלל, אני ממש מרוכז ונהנה ללמוד, ואני לא חושש לעבוד בתחום שלי בעבודות התחלתיות עם שכר נמוך יחסית אבל שמעניינות אותי ומאתגרות אותי ועל הדרך אני צובר נסיון בתחום. \t\t\t\t\t  \t\t \t\t\t  \t\t      \t\t     \t\t \t \n" +
            "בקיצור, יש לכם אחים קטנים? חברים לפני תואר? תגידו להם שיתנו גז בעבודה כל עוד הם יכולים, האקדמיה לא בורחת לשום מקום.\t\t \t \t\t\t\t\t \t\t\t  \t\t  \t\t  \t\t \t\t   \t\t \t\t\t  \t   \t\t  \t\t \t\t\t \t   \t\t\t  \t\t \t\t\t\t\t \t\n" +
            "הערה למגדפים: גדלתי בבית עני מאוד , ברמה של אין אוכל במקרר, אין רכב, אין בית להורים, כלום! העזרה במקרה שלנו היא שלי אליהם! אולי משם הגיע הרצון לשקט כלכלי...\n"
    val lines = string.lines()
    val spaces = lines.map { it -> it.split(".").last().split("").union(listOf("\n")) }
    val code = spaces.flatten().map { if(it == " ") 'S' else if(it == "\n") 'L' else if(it == "\t") 'T' else "" }
            .joinToString("")
    println(code)

}